src/CF/Catalogs/Git_НастройкиРепозиториев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Git_НастройкиРепозиториев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКРепозиторию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколСоединения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Git_ПротоколыСоединения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьЛокальногоХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Git_СпособыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Enums/Git_СпособыАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>Git_СпособыАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПаролю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OAuth</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/Git_НастройкиРепозиториев/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Возвращает строку соединения для подключения к Git.
//
// Параметры:
//  Настройка   - СправочникСсылка.Git_НастройкиРепозиториев
// 
// Возвращаемое значение:
//  Строка
Функция ПолучитьСтрокуСоединения(Настройка) Экспорт 

	Если Настройка.СпособАвторизации = Перечисления.Git_СпособыАвторизации.OAuth Тогда
		ДанныеАвторизации = Git_ПолныеПрава.ПрочитатьДанныеИзБезопасногоХранилища(Настройка, "Токен");
		Если Не ДанныеАвторизации = Неопределено Тогда
			СтрокаАвторизации = "" + ДанныеАвторизации + "@";		
		КонецЕсли;
	ИначеЕсли Настройка.СпособАвторизации = Перечисления.Git_СпособыАвторизации.ПоПаролю Тогда
		ДанныеАвторизации = Git_ПолныеПрава.ПрочитатьДанныеИзБезопасногоХранилища(Настройка, 
																						"Логин, Пароль"); 
		Если Не ДанныеАвторизации = Неопределено Тогда
			СтрокаАвторизации = "" + ДанныеАвторизации.Логин + ":" + ДанныеАвторизации.Пароль + "@";
		Иначе
			СтрокаАвторизации = "";
		КонецЕсли;
	Иначе
		СтрокаАвторизации = "";
	КонецЕсли; 
	
	Возврат Строка(Настройка.ПротоколСоединения) + СтрокаАвторизации + Настройка.ПутьКРепозиторию;
	
КонецФункции
#КонецОбласти
